base/Catalogs/бит_ШаблоныПроводокБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныПроводокБюджетирования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДТ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКТ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ШаблоныПроводокБюджетирования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	СвойстваСчетаДт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетДТ);
	СвойстваСчетаКт = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетКТ);
	ПредставлениеДт = Метаданные.Справочники.бит_ШаблоныПроводокБюджетирования.Реквизиты.СчетДТ.Представление();
	ПредставлениеКт = Метаданные.Справочники.бит_ШаблоныПроводокБюджетирования.Реквизиты.СчетКТ.Представление();
	
	Если НЕ ЗначениеЗаполнено(СчетДТ) И НЕ ЗначениеЗаполнено(СчетКТ) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "Заполнение", ПредставлениеДт);		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СчетДТ", , Отказ);
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "Заполнение", ПредставлениеКт);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СчетКТ", , Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СчетДТ) 
		И ЗначениеЗаполнено(СчетКТ) 
		И (СвойстваСчетаДт.Забалансовый <> СвойстваСчетаКт.Забалансовый)  Тогда
				
		Представление = ?(СвойстваСчетаДт.Забалансовый, ПредставлениеДт, ПредставлениеКт);
		Поле		  = ?(СвойстваСчетаДт.Забалансовый, "СчетДТ", "СчетКТ");
	
		Пояснение = НСтр("ru = 'Балансовый счет не может корреспондировать с забалансовым.'; 
							|en = 'The balance account cannot correspond with the off-balance sheet.'");
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "Корректность", 
							Представление,,, Пояснение);		

		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, ,Отказ); 			   
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СчетДТ) И НЕ ЗначениеЗаполнено(СчетКТ) 
		И НЕ СвойстваСчетаДт.Забалансовый Тогда
		Пояснение = НСтр("ru = 'Балансовый счет не может корреспондировать с пустым.'; 
							|en = 'The balance account cannot correspond with an empty one.'");
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "Заполнение", 
							ПредставлениеКт,,, Пояснение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СчетКТ", ,Отказ); 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(СчетКТ) И НЕ ЗначениеЗаполнено(СчетДТ) 
		И НЕ СвойстваСчетаКт.Забалансовый Тогда
		Пояснение = НСтр("ru = 'Балансовый счет не может корреспондировать с пустым.'; 
							|en = 'The balance account cannot correspond with an empty one.'");
		
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "Заполнение", 
							ПредставлениеДт,,, Пояснение);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СчетДТ", ,Отказ); 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ЧастиИмени = Новый Массив;
		Если ЗначениеЗаполнено(СчетДТ) Тогда
			ЧастиИмени.Добавить(СчетДТ);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СчетКТ) Тогда
			ЧастиИмени.Добавить(СчетКТ);
		КонецЕсли;
		Наименование = СтрСоединить(ЧастиИмени, " - ");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
